# Loading data from SQL

## Load data from SQLITE Database file

In [1]:
import os 
os.chdir('C:\\Users\\ssson\\OneDrive\\Desktop\\JUPYTER WORK NOTEBOOK - NIMISHA')

In [2]:
import pandas as pd

In [8]:
from sqlalchemy import create_engine

# Connect to sqlite db file

db_file = r'datasets/gradedata.db' # this code creates a link to the database file ("gradedata.db")
engine = create_engine(r"sqlite:///{}"
        .format(db_file))

sql = 'SELECT * from test'
'Where grades in (76,77,78)'
    
sales_data_df = pd.read_sql(sql, engine)

In [9]:
sales_data_df

   index    Names  Grades
0      0      Bob      76
1      1  Jessica      95
2      2     Mary      77
3      3     John      78
4      4      Mel      99

In [10]:
# For finding the name of table in sql database by this query

In [11]:
sql = "select name from sqlite_master"
"where type = 'table';"

"where type = 'table';"

In [13]:
# when know table name can type this query

In [15]:
sql = "select * from test;"

In [17]:
sql # thi squery will work in sql database

'select * from test;'

# Saving Data to SQL

In [24]:
# Crete dataset to save

name = ["nimisha", "jacky", "alvin", "asim", "hadelin"]
grades = [95,76,88,59,71]
Gradelist= zip(name, grades)
df = pd.DataFrame(data = Gradelist, columns = ['name', 'grades'])
df

      name  grades
0  nimisha      95
1    jacky      76
2    alvin      88
3     asim      59
4  hadelin      71

In [25]:
# now export dataframe to sqlite

In [26]:
import os
import sqlite3 as lite

In [29]:
db_filename = r'mydb.db'
con = lite.connect(db_filename)
df.to_sql('mytable', con, schema = None, if_exists = 'replace', index = True, index_label = None, chunksize = None, dtype = None)
con.close()

In [30]:
# Get Help on to_sql
df.to_sql?